alibaba/AliOS-Things/platform/mcu/lpc54102/LPC54102_cm4.h
/*! @name USART_INTSTATUSART - USART0 interrupt status */
#define VFIFO_USART_INTSTATUSART_RXTH_MASK       (0x1U)
#define VFIFO_USART_INTSTATUSART_RXTH_SHIFT      (0U)
#define VFIFO_USART_INTSTATUSART_RXTH(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_RXTH_SHIFT)) & VFIFO_USART_INTSTATUSART_RXTH_MASK)
#define VFIFO_USART_INTSTATUSART_TXTH_MASK       (0x2U)
#define VFIFO_USART_INTSTATUSART_TXTH_SHIFT      (1U)
#define VFIFO_USART_INTSTATUSART_TXTH(x)         (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_TXTH_SHIFT)) & VFIFO_USART_INTSTATUSART_TXTH_MASK)
#define VFIFO_USART_INTSTATUSART_RXTIMEOUT_MASK  (0x10U)
#define VFIFO_USART_INTSTATUSART_RXTIMEOUT_SHIFT (4U)
#define VFIFO_USART_INTSTATUSART_RXTIMEOUT(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_RXTIMEOUT_SHIFT)) & VFIFO_USART_INTSTATUSART_RXTIMEOUT_MASK)
#define VFIFO_USART_INTSTATUSART_BUSERR_MASK     (0x80U)
#define VFIFO_USART_INTSTATUSART_BUSERR_SHIFT    (7U)
#define VFIFO_USART_INTSTATUSART_BUSERR(x)       (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_BUSERR_SHIFT)) & VFIFO_USART_INTSTATUSART_BUSERR_MASK)
#define VFIFO_USART_INTSTATUSART_RXEMPTY_MASK    (0x100U)
#define VFIFO_USART_INTSTATUSART_RXEMPTY_SHIFT   (8U)
#define VFIFO_USART_INTSTATUSART_RXEMPTY(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_RXEMPTY_SHIFT)) & VFIFO_USART_INTSTATUSART_RXEMPTY_MASK)
#define VFIFO_USART_INTSTATUSART_TXEMPTY_MASK    (0x200U)
#define VFIFO_USART_INTSTATUSART_TXEMPTY_SHIFT   (9U)
#define VFIFO_USART_INTSTATUSART_TXEMPTY(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_TXEMPTY_SHIFT)) & VFIFO_USART_INTSTATUSART_TXEMPTY_MASK)
#define VFIFO_USART_INTSTATUSART_RXCOUNT_MASK    (0xFF0000U)
#define VFIFO_USART_INTSTATUSART_RXCOUNT_SHIFT   (16U)
#define VFIFO_USART_INTSTATUSART_RXCOUNT(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_RXCOUNT_SHIFT)) & VFIFO_USART_INTSTATUSART_RXCOUNT_MASK)
#define VFIFO_USART_INTSTATUSART_TXCOUNT_MASK    (0xFF000000U)
#define VFIFO_USART_INTSTATUSART_TXCOUNT_SHIFT   (24U)
#define VFIFO_USART_INTSTATUSART_TXCOUNT(x)      (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_INTSTATUSART_TXCOUNT_SHIFT)) & VFIFO_USART_INTSTATUSART_TXCOUNT_MASK)

/* The count of VFIFO_USART_INTSTATUSART */
#define VFIFO_USART_INTSTATUSART_COUNT           (4U)

/*! @name USART_CTLSETUSART - USART0 control read and set register. A complete value may be read from this register. Writing a 1 to any implemented bit position causes that bit to be set. */
#define VFIFO_USART_CTLSETUSART_RXTHINTEN_MASK   (0x1U)
#define VFIFO_USART_CTLSETUSART_RXTHINTEN_SHIFT  (0U)
#define VFIFO_USART_CTLSETUSART_RXTHINTEN(x)     (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_RXTHINTEN_SHIFT)) & VFIFO_USART_CTLSETUSART_RXTHINTEN_MASK)
#define VFIFO_USART_CTLSETUSART_TXTHINTEN_MASK   (0x2U)
#define VFIFO_USART_CTLSETUSART_TXTHINTEN_SHIFT  (1U)
#define VFIFO_USART_CTLSETUSART_TXTHINTEN(x)     (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_TXTHINTEN_SHIFT)) & VFIFO_USART_CTLSETUSART_TXTHINTEN_MASK)
#define VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_MASK (0x10U)
#define VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_SHIFT (4U)
#define VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_SHIFT)) & VFIFO_USART_CTLSETUSART_RXTIMEOUTINTEN_MASK)
#define VFIFO_USART_CTLSETUSART_RXFLUSH_MASK     (0x100U)
#define VFIFO_USART_CTLSETUSART_RXFLUSH_SHIFT    (8U)
#define VFIFO_USART_CTLSETUSART_RXFLUSH(x)       (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_RXFLUSH_SHIFT)) & VFIFO_USART_CTLSETUSART_RXFLUSH_MASK)
#define VFIFO_USART_CTLSETUSART_TXFLUSH_MASK     (0x200U)
#define VFIFO_USART_CTLSETUSART_TXFLUSH_SHIFT    (9U)
#define VFIFO_USART_CTLSETUSART_TXFLUSH(x)       (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLSETUSART_TXFLUSH_SHIFT)) & VFIFO_USART_CTLSETUSART_TXFLUSH_MASK)

/* The count of VFIFO_USART_CTLSETUSART */
#define VFIFO_USART_CTLSETUSART_COUNT            (4U)

/*! @name USART_CTLCLRUSART - USART0 control clear register. Writing a 1 to any implemented bit position causes the corresponding bit in the related CTLSET register to be cleared. */
#define VFIFO_USART_CTLCLRUSART_RXTHINTCLR_MASK  (0x1U)
#define VFIFO_USART_CTLCLRUSART_RXTHINTCLR_SHIFT (0U)
#define VFIFO_USART_CTLCLRUSART_RXTHINTCLR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_RXTHINTCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_RXTHINTCLR_MASK)
#define VFIFO_USART_CTLCLRUSART_TXTHINTCLR_MASK  (0x2U)
#define VFIFO_USART_CTLCLRUSART_TXTHINTCLR_SHIFT (1U)
#define VFIFO_USART_CTLCLRUSART_TXTHINTCLR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_TXTHINTCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_TXTHINTCLR_MASK)
#define VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR_MASK (0x10U)
#define VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR_SHIFT (4U)
#define VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR(x) (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_RXTIMEOUTINTCLR_MASK)
#define VFIFO_USART_CTLCLRUSART_RXFLUSHCLR_MASK  (0x100U)
#define VFIFO_USART_CTLCLRUSART_RXFLUSHCLR_SHIFT (8U)
#define VFIFO_USART_CTLCLRUSART_RXFLUSHCLR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_RXFLUSHCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_RXFLUSHCLR_MASK)
#define VFIFO_USART_CTLCLRUSART_TXFLUSHCLR_MASK  (0x200U)
#define VFIFO_USART_CTLCLRUSART_TXFLUSHCLR_SHIFT (9U)
#define VFIFO_USART_CTLCLRUSART_TXFLUSHCLR(x)    (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_CTLCLRUSART_TXFLUSHCLR_SHIFT)) & VFIFO_USART_CTLCLRUSART_TXFLUSHCLR_MASK)

/* The count of VFIFO_USART_CTLCLRUSART */
#define VFIFO_USART_CTLCLRUSART_COUNT            (4U)

/*! @name USART_RXDATUSART - USART0 received data */
#define VFIFO_USART_RXDATUSART_RXDAT_MASK        (0x1FFU)
#define VFIFO_USART_RXDATUSART_RXDAT_SHIFT       (0U)
#define VFIFO_USART_RXDATUSART_RXDAT(x)          (((uint32_t)(((uint32_t)(x)) << VFIFO_USART_RXDATUSART_RXDAT_SHIFT)) & VFIFO_USART_RXDATUSART_RXDAT_MASK)

